Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: See L<perlop> for details.
es_es: Vea L<perlop> para más detalles.

source: Values for LEVEL can also be obtained from getprotobyname.
es_es: Los valores para NIVEL también se pueden obtener de getprotobyname.

source: Note also that:
es_es: Tenga en cuenta también que:

source: How can I build my own Perl interpreter?
es_es: ¿Cómo puedo compilar mi propio intérprete de Perl?

source: Returns the integer number of seconds actually slept.
es_es: Devuelve el número entero de segundos realmente dormidos.

source: pluggable optimizer
es_es: optimizador conectable

source: Provides a faster implementation of C<expand>
es_es: Proporciona una implementación más rápida de C<expand>

source: For example, in C<2 + 4 * 5>, the multiplication has higher precedence so C<4 * 5> is evaluated first yielding C<2 + 20 == 22> and not C<6 * 5 == 30>.
es_es: Por ejemplo, en C<2 + 4 * 5>, la multiplicación tiene una precedencia mayor por lo que C<4 * 5> es evaluado primero, resultando C<2 + 20 == 22> y no C<6 * 5 == 30>.

source: Binary "eq" returns true if the left argument is stringwise equal to the right argument.
es_es: Binario "eq" devuelve verdadero si el argumento de la izquierda es alfanuméricamente igual que el argumento de la derecha.

source: So C<my $logmessage = shift;> shifts the first item off the list of arguments and assigns it to C<$logmessage>.
es_es: Así, C<my $mensaje_registro = shift;> quita el primer elemento de la lista de argumentos y se lo asigna a C<$mensaje_registro>.

source: The Perl 5 interpreter was a complete re-write of the previous perl sources.
es_es: El intérprete de Perl 5 fue una reescritura completa del código fuente de perl.

source: use sort '_mergesort'; # note discouraging _
es_es: use sort '_mergesort'; # note el desalentador _

source: =head2 UTF-8 On Filehandles No Longer Activated By Locale
es_es: =head2 UTF-8 en identificadores de archivo ya no son activados por locale

source: print 1+2+4; # Prints 7.
es_es: print 1+2+4; # Imprime 7.

source: It returns the position of the first occurrence of SUBSTR in STR at or after POSITION.
es_es: Devuelve la posición de la primera ocurrencia de SUBSTR en STRING en o después de POSICIÓN.

source: C<O_EXCL> may not work on network filesystems, and has no effect unless the C<O_CREAT> flag is set as well.
es_es: C<O_EXCL> quizás no funcione en sistemas de archivos en red, y no tiene ningún efecto a menos que el indicador C<O_CREAT> también esté establecido.

source: The reason that doesn't do what you want is because assigning a named array like that to a scalar is taking an array in scalar context, which means just counts the number of elements in @tmp.
es_es: La razón de que no hace lo que usted quiere que haga es porque la asignación de un array con nombre como si fuera un escalar es tomado como si se tomara un escalar de un array en contexto escalar, lo que significa que sólo obtenemos el número de elementos que hay en @tmp.

source: You can find the latest releases at http://www.cpan.org/src/README.html .
es_es: Encontrará las versiones más recientes en http://www.cpan.org/src/README.html .

source: If C<Module::CoreList> is not installed on your system, check out http://perlpunks.de/corelist .
es_es: Si C<Module::CoreList> no está instalado en su sistema, visite http://perlpunks.de/corelist .

source: S_ISBLK($mode) S_ISCHR($mode) S_ISFIFO($mode) S_ISSOCK($mode)
es_es: S_ISBLK($modo) S_ISCHR($modo) S_ISFIFO($modo) S_ISSOCK($modo)

source: split(" ", q/STRING/);
es_es: split(" ", q/CADENA/);

source: F<cpanp> is, like F<cpan>, a command-line interface to the CPAN, using the C<CPANPLUS> module as a back-end.
es_es: F<cpanp> es otra interfaz de línea de comandos de CPAN (una alternativa a F<cpan>) que usa el módulo C<CPANPLUS> como back-end.

source: Binary "ge" returns true if the left argument is stringwise greater than or equal to the right argument.
es_es: Binario "ge" devuelve verdadero si el argumento de la izquierda es alfanuméricamente mayor o igual que el argumento de la derecha.

source: C<POST_MAX> doesn't cause the client to hang any more
es_es: C<POST_MAX> ya no provoca que el cliente se quede colgado

source: left and
es_es: izquierda and

source: 0b011011 # binary
es_es: 0b011011 # binario

source: The price is $Price.
es_es: El precio es $Precio.

source: This safer version of L</chop> removes any trailing string that corresponds to the current value of C<$/> (also known as $INPUT_RECORD_SEPARATOR in the C<English> module).
es_es: Esta es la versión segura de L</chop>, que quita cualquier string restante que corresponda al valor actual de C<$/> (también conocido como $INPUT_RECORD_SEPARATOR -separador de registros en entrada- en el módulo C<English>).

source: # and UTF-8.
es_es: # y UTF-8.

source: Code freeze for the next maintenance release (5.8.4) is on March 31st 2004, with release expected by mid April.
es_es: Código congelado para la próxima versión de mantenimiento (5.8.4) será el 31 de marzo de 2004, con el lanzamiento previsto para mediados de abril.

source: You will need to seek() to do the reading.
es_es: Necesitará usar seek() para hacer la lectura.

source: =item Arithmetic operators
es_es: =item Operadores aritméticos

source: =head3 (Reminder) Pseudo-hashes are deprecated (really)
es_es: =head3 (Recordatorio) Pseudo-hashes están en desuso (de verdad)

source: # if you're building a development version
es_es: # si está construyendo una versión de desarrollo

source: This section of the FAQ answers questions about where to find source and documentation for Perl, support, and related matters.
es_es: Esta sección de preguntas más frecuentes indica dónde se puede obtener el código fuente y la documentación de Perl, cómo obtener soporte técnico, y ofrece información sobre otros temas relacionados.

source: Perl 5.9.0 has experimental support for assertions.
es_es: Perl 5.9.0 tiene soporte experimental para las aserciones.

source: It always succeeds, and its C<code> is not interpolated.
es_es: Siempre tiene éxito, y el C<código> no es interpolado.

source: When C<system>'s arguments are executed indirectly by the shell, results and return codes are subject to its quirks.
es_es: Cuando los argumentos de C<system> son ejecutados indirectamente por el shell, los resultados y los códigos de retorno están sujetos a sus caprichos.

source: See L</my>.
es_es: Ver L</my>.

source: Behavior in list context depends on the particular operator.
es_es: El comportamiento en contexto de lista depende del propio operador.

source: set C<$Module::errstr> or similar (C<errstr> is a common name used by DBI and other popular modules; if you choose something else, be sure to document it clearly).
es_es: poner C<$Module::errstr> o similar (C<errstr> es un nombre común usado por DBI y otros módulos populares; si elije otro, asegúrese de documentarlo claramente).

# printf "Connect to %s [%s] ",
source: printf "Connect to %s [%s]\n",
es_es: printf "Conectar a %s [%s]\n",

source: This warning has now been avoided by Configure weeding out such directories before the compilation.
es_es: Esta advertencia ha sido eliminada para no confundir a Configure de esos directorios antes de la compilación.

source: CPANPLUS, Inline, and Module::Build will become core modules.
es_es: CPANPLUS, Inline, y Module::Build se convertirán en módulos principales.

source: C<File::Spec> upgraded to version 3.12
es_es: C<File::Spec> actualizado a la versión 3.12

source: Sometimes you may want to truncate an already-existing file.
es_es: A veces puede querer truncar un archivo ya existente.

source: p When matching preserve a copy of the matched string so
es_es: p Cuando exista una coincidencia preserva una copia de la cadena concordante,

source: The J.R.R.
es_es: Las citas de J.R.R.

source: "\N{LATIN SMALL LIGATURE FI}" =~ /[fi][fi]/i; # Doesn't match!
es_es: "\N{LATIN SMALL LIGATURE FI}" =~ /[fi][fi]/i; # ¡No coincide!

source: =head1 LIST OF UTILITIES
es_es: =head1 LISTA DE UTILIDADES

source: A negative OFFSET specifies writing that many characters counting backwards from the end of the string.
es_es: Un DESPLAZAMIENTO negativo especifica escribir tantos caracteres contando desde el final de la cadena.

source: =head2 Conditional and looping constructs
es_es: =head2 Estructuras condicionales y de bucle

source: Note that C<fcntl> raises an exception if used on a machine that doesn't implement fcntl(2).
es_es: Tenga en cuenta que C<fcntl> levanta una excepción si se utiliza en una máquina que no implemente fcntl(2).

source: This surprising autovivification in what does not at first--or even second--glance appear to be an lvalue context may be fixed in a future release.
es_es: Esta sorprendente autovivificación en que al primer vistazo -o incluso al segundo- parece que es un contexto lvalor quizás será arreglado en una futura distribución.

source: require $class; # $class is not a bareword
es_es: require $clase; # $clase no es una palabra suelta

source: (Contributed by Dave Mitchell.)
es_es: (Escrito por Dave Mitchell.)

# print 'Hello, $name '; # prints $name literally
source: print 'Hello, $name\n'; # prints $name\n literally
es_es: print 'Hola, $nombre\n'; # imprime $nombre\n literalmente

source: It's used as the default argument to a number of functions in Perl, and it's set implicitly by certain looping constructs.
es_es: Se usa como argumento predeterminado de varias funciones de Perl y su valor se establece implícitamente en determinadas estructuras de bucle.

source: It's used by C<Archive::Tar> (see below).
es_es: Es utilizado por C<Archive::Tar> (ver más abajo).

source: The names I<big-endian> and I<little-endian> are comic references to the egg-eating habits of the little-endian Lilliputians and the big-endian Blefuscudians from the classic Jonathan Swift satire, I<Gulliver's Travels>.
es_es: Los nombres I<big-endian> y I<little-endian> son referencias cómicas a los hábitos alimenticios de comer huevos por el extremo pequeño de los Liliputienses y por el extremo grande de los Blefuscudianos de la clásica sátira de Jonathan Swift, I<Los Viajes de Gulliver> .

source: The UTF-8 caching code is now more efficient, and used more often.
es_es: El código de cacheo de UTF-8 es ahora más eficiente, y se utiliza con más frecuencia.

source: Note that "&" has lower priority than relational operators, so for example the brackets are essential in a test like
es_es: Tenga en cuenta que "&" tiene una menor prioridad que los operadores relaciones, así que, por ejemplo, los paréntesis son esenciales en una prueba como

# print "Username is $1 ";
source: print "Username is $1\n";
es_es: print "El nombre de usuario es $1\n";

source: =item seekdir DIRHANDLE,POS X<seekdir>
es_es: =item seekdir IDENTIFICADOR_DIR,POS X<seekdir>

source: On some older systems, it may sleep up to a full second less than what you requested, depending on how it counts seconds.
es_es: En algunos sistemas antiguos, se puede dormir hasta un segundo meno de lo que ha solicitado, en función de la forma en cómo se cuenten los segundos.

source: All are different from C<[a-z]>, which specifies a class containing twenty-six characters, even on EBCDIC-based character sets.) Also, if you try to use the character classes C<\w>, C<\W>, C<\s>, C<\S>, C<\d>, or C<\D> as endpoints of a range, the "-" is understood literally.
es_es: Todos son diferentes de C<[a-z]>, que especifica una clase que contiene veintiséis caracteres, incluso en los juegos de caracteres basados en EBCDIC.) Además, si intenta utilizar las clases de caracteres C<\w>, C<\W>, C<\s>, C<\S>, C<\d>, o C<\D> como criterios de valoración de una serie, el "-" es tomado de forma literal.

source: perl5112delta Perl changes in version 5.11.2
es_es: perl5112delta Cambios en la versión 5.11.2

source: See L<perlunicode> for more about Unicode.
es_es: Vea L<perlunicode> para más información acerca de Unicode.

source: During this search, text between the starting and ending delimiters is copied to a safe location.
es_es: Durante esta búsqueda, el texto entre los delimitadores inicial y final se copia a un lugar seguro.

source: README.mpeix - Perl/iX for HP e3000 MPE
es_es: README.mpeix - Perl/iX para el HP e3000 MPE

source: Returns the number of bytes actually read, C<0> at end of file, or undef if there was an error (in the latter case C<$!> is also set).
es_es: Devuelve el número de bytes realmente leídos, C<0> al final del archivo, o undef si hubo un error (en este último caso, también se establece C<$!>).

source: That means it was never a list to start with.
es_es: Esto significa que nunca será una lista.

source: The PLAINTEXT and SALT are turned into a short string, called a digest, which is returned.
es_es: El TEXTOPLANO y el SALTO se convierten en un pequeño string, llamado I<digest> (compendio, resumen), que es devuelto.

source: Can your module be broken down into a family of related modules?
es_es: ¿Puede su módulo dividirse en una familia de módulos relacionados?

source: The hash randomisation is certain to reveal hidden assumptions about some particular ordering of hash elements, and outright bugs: it revealed a few bugs in the Perl core and core modules.
es_es: La asignación al azar de un hash sirvió para revelar suposiciones ocultas acerca de alguna ordenación particular de los elementos de un hash, y errores definitivos: reveló un par de errores en el núcleo de Perl y en los módulos básicos.

source: See L<perlport/gmtime> for portability concerns.
es_es: Ver L<perlport/gmtime> para problemas sobre portabilidad.

source: =item package NAMESPACE VERSION BLOCK X<package> X<module> X<namespace> X<version>
es_es: =item package ESPACIO_NOMBRES VERSIÓN BLOQUE X<package> X<module> X<namespace> X<version> X<paquete> X<módulo> X<espacio de nombres> X<versión>

source: The sequence number is reset for each range encountered.
es_es: El número de secuencia se reinicia para cada rango encontrado.

source: Use C<sysseek(FH, 0, 1)> for that.
es_es: Use C<sysseek(FH, 0, 1)> para eso.

source: The copy will always be a plain string, even if the input is an object or a tied variable.
es_es: La copia siempre será una cadena normal, incluso si la entrada es un objeto o una variable enlazada.

source: C<if> upgraded to version 0.05
es_es: C<if> actualizado a la versión 0.05

# if (eof()) { # check for end of last file print "-------------- ";
source: if (eof()) { # check for end of last file print "--------------\n";
es_es: if (eof()) { # chequea por el final del último archivo print "--------------\n";

source: If the right operand is zero or negative, it returns an empty string or an empty list, depending on the context.
es_es: Si el operando derecho es cero o negativo, devuelve una cadena vacía o una lista vacía, dependiendo del contexto.

source: Such constructs are quite frequently used, because older versions of Perl had no official C<switch> statement.
es_es: Estas construcciones son muy frecuentes, porque las versiones anteriores de Perl no tenían oficialmente una instrucción C<switch>.

source: Interprets EXPR as an octal string and returns the corresponding value.
es_es: Interpreta EXPR como una cadena en octal y devuelve el valor correspondiente.

source: Checksum is calculated by summing numeric values of expanded values (for string fields the sum of C<ord($char)> is taken; for bit fields the sum of zeroes and ones).
es_es: La suma de comprobación se calcula sumando los valores numéricos de los valores expandidos (para los campos de cadena se toma la suma de C<ord($char)>; para los campos de bits, la suma de ceros y unos).

source: =item C<(?'NAME'pattern)>
es_es: =item C<(?'NOMBRE'patrón)>

source: @new = map { $_->[0] } sort { $b->[1] <=> $a->[1] || $a->[2] cmp $b->[2]
es_es: @nuevo = map { $_->[0] } sort { $b->[1] <=> $a->[1] || $a->[2] cmp $b->[2]

source: Amongst other things, this may have the effect of calling stdio's clearerr(3).
es_es: Entre otras cosas, esto puede tener el efecto de llamar a los clearerr(3) de stdio.

source: Community support in places such as Perlmonks ( http://www.perlmonks.com ) and the various Perl mailing lists ( http://lists.perl.org ) means that you can usually get quick answers to your problems.
es_es: La comunidad ofrece soporte en foros como Perlmonks ( http://www.perlmonks.com ) y las distintas listas de correo de Perl ( http://lists.perl.org ). Generalmente, siempre que plantee algún problema recibirá rápidamente ayuda para solucionarlo.

source: Alternatively, you may inspect the value of C<${^CHILD_ERROR_NATIVE}> with the C<W*()> calls from the POSIX module.
es_es: Alternativamente, puede inspeccionar el valor de C<${^CHILD_ERROR_NATIVE}> con las llamadas C<W*()> desde el módulo POSIX.

source: Tied methods like FETCH etc. may now safely access tied values, i.e. resulting in a recursive call to FETCH etc. Remember to break the recursion, though.
es_es: Métodos enlazados como FETCH, etc ahora pueden acceder de forma segura a los valores enlazados, es decir, que resulta en una llamada recursiva a FETCH, etc. Recuerde, sin embargo, romper la recursión.

source: Returns the number of files successfully changed.
es_es: Devuelve el número de archivos cambiados con éxito.

source: =head2 README, INSTALL, release notes, changelogs
es_es: =head2 README, INSTALL, notas de lanzamiento, changelogs

source: the other
es_es: el otro

source: utf8::is_utf8() has been added as a quick way to test whether a scalar is encoded internally in UTF-8 (Unicode).
es_es: utf8::is_utf8() ha sido añadido como una forma rápida de comprobar cuándo un escalar está codificado internamente en UTF-8 (Unicode).

source: In order, these are:
es_es: En fin, estos son:

source: C<Unicode::Collate> upgraded to version 0.52
es_es: C<Unicode::Collate> actualizada a la versión 0.52

source: For example, because named unary operators are higher precedence than ||:
es_es: Por ejemplo, debido a que los operadores unarios con nombre tienen mayor precedencia que ||:

source: Returns true if those operations succeed and if no error was reported by any PerlIO layer.
es_es: Devuelve verdadero si las operaciones han tenido éxito y si ningún error fue reportado por alguna capa PerlIO.

source: This is part of the change to allow the internal use of any code point (see L</Core Enhancements>).
es_es: Esto es parte del cambio para permitir el uso interno de cualquier punto de código (vea L</Mejoras del núcleo>).

source: =item Gtk and Gtk2
es_es: =item Gtk y Gtk2

source: Recall that which of C<yes-pattern> or C<no-pattern> actually matches is already determined.
es_es: Recordemos que realmente ya están determinadas las coincidencias de C<patrón-sí> o de C<patrón-no>.

source: For many people, Perl serves as a great replacement for shell scripting.
es_es: Para muchas personas, Perl es un buen sustituto de los scripts de shell.

source: If you believe you have an unreported bug, please run the B<perlbug> program included with your release.
es_es: Si usted cree que tiene un error no declarado, por favor, ejecute el programa B<perlbug> incluido en su distribución.

source: Define a named capture group.
es_es: Define un grupo de captura con nombre.

source: In the form of pipe opens taking three or more arguments, if LIST is specified (extra arguments after the command name) then LIST becomes arguments to the command invoked if the platform supports it.
es_es: En la forma de tubería tomando tres o más argumentos, si se especifica LISTA (argumentos adicionales después del nombre del comando) entonces LISTA son los argumentos para el comando invocado, si la plataforma lo soporta.

source: You can intermix C<m//g> matches with C<m/\G.../g>, where C<\G> is a zero-width assertion that matches the exact position where the previous C<m//g>, if any, left off.
es_es: Puede entremezclar coincidencias C<m//g> con C<m/\G.../g>, donde C<\G> es una aserción de ancho cero que coincide con la posición exacta en que la anterior C<m//g>, si hubo, se detuvo.

source: This is nice, but if you forget your trailing quote, the error will not be reported until Perl finds another line containing the quote character, which may be much further on in the script.
es_es: Esto es bueno, pero si se le olvida cerrar el entrecomillado, el error no será reportado hasta que Perl encuentre otra línea que contenga el carácter de comillas, que puede estar mucho más allá en el programa.

source: =item index STR,SUBSTR
es_es: =item index STRING,SUBSTR

source: See L<perlmroapi> for more information.
es_es: Vea L<perlmroapi> para obtener más información.

source: This operator has the same precedence and associativity as C<||>.
es_es: Este operador tiene la misma prioridad y asociatividad que C<||>.

source: No longer uses C<Sys::Hostname> as it may provide useless values in unconfigured network environments, so instead uses C<INADDR_LOOPBACK> directly.
es_es: Ya no utiliza C<Sys::Hostname> ya que puede proporcionar valores inútiles en entornos de red sin configurar, así que, en vez de eso, utiliza C<INADDR_LOOPBACK> directamente.

source: =head1 BEFORE YOU START WRITING A MODULE
es_es: =head1 ANTES DE COMENZAR A ESCRIBIR UN MÓDULO

source: One is for generating predictable results generally for testing or debugging.
es_es: Uno de ellos es para la generación de resultados predecibles, generalmente para pruebas o depuraciones.

source: To avoid this warning, make sure to pad your octal number with C<0>'s: C<"\0128">.
es_es: Para evitar la aparición de esta advertencia, asegúrese de rellenar su número octal con C<0>: C<"\0128">.

source: for $file (@ARGV) {
es_es: for $archivo (@ARGV) {

source: They're also supported as operators in their own right.
es_es: Son también operadores.

source: PRINT this, LIST
es_es: PRINT este, LISTA

source: Redeclaration of "sendpath" with a different storage class specifier:
es_es: Redeclaración de "sendpath" con un especificador de clase de almacenamiento especifico:

source: Returns the next character from the input file attached to FILEHANDLE, or the undefined value at end of file or if there was an error (in the latter case C<$!> is set).
es_es: Devuelve el siguiente carácter desde el archivo de entrada asociado a IDENTIFICADOR_ARCHIVO, o el valor indefinido al final del archivo, o si ocurrió un error (en este último caso, se actualiza C<$!>).

source: @chars = split //, $string; # // is not magic in split
es_es: @chars = split //, $string; # // no es mágico en split

source: The lib/Net/servent failure seems to be a bug in the test program.
es_es: El error en lib/Net/servent parece que es un error en el programa de pruebas.

source: S_ISREG($mode) S_ISDIR($mode) S_ISLNK($mode)
es_es: S_ISREG($modo) S_ISDIR($modo) S_ISLNK($modo)

source: C<Sys::Syslog> has been changed to protect people from poor quality third party code.
es_es: C<Sys::Syslog> ha sido cambiado para proteger a los usuarios de la pobre calidad del código de terceros.

source: =head2 New "Possible precedence problem on bitwise %c operator"
es_es: =head2 Nuevo "I<Possible precedence problem on bitwise %c operator>" (Posible problema de precedencia en el operador de bit %c)

source: =item getprotobynumber NUMBER
es_es: =item getprotobynumber NÚMERO

source: open(FOO, "-|", "cat -n '$file'");
es_es: open(FOO, "-|", "cat -n '$archivo'");

source: printf '<%010.6x>', 1; # prints "< 000001>"
es_es: printf '<%010.6x>', 1; # imprime "< 000001>"

source: If there is no real file descriptor at the OS level, as can happen with filehandles connected to memory objects via C<open> with a reference for the third argument, -1 is returned.
es_es: Si no hay un descriptor de archivo real al nivel del sistema operativo, como puede suceder con identificadores de archivo relacionados con objetos de memoria a través de C<open> con una referencia para el tercer argumento, se devuelve -1.
